Repository: IBMPredictiveAnalytics/SPSSINC_TRANS
Catalog: src/lang/*/SPSSINC_TRANS.po
Languages: de, es, fr, it, ja, ko, pl, pt_br, ru, zh_cn, zh_tw

source: The formula specified a class, but the class did not produce a suitable function to call
de: Die Formel hat eine Klasse angegeben, die Klasse erstellte jedoch keine geeignete Funktion für einen Aufruf.
es: La fórmula ha especificado una clase, pero la clase no ha producido una función adecuada para una llamada
fr: La formule a spécifié une classe, mais la classe n'a pas généré de fonction adéquate à appeler
it: La formula ha specificato una classe, ma la classe non ha generato una funzione adatta da richiamare
ja: 式はクラスを指定しましたが、クラスはコールするのに適切な関数を作成しませんでした。
ko: 수식에서 클래스를 지정하지만 호출할 적절한 함수를 클래스가 생성하지 않았습니다.
pl: Wzór ten określał klasę, ale klasa nie generowała przywołania odpowiedniej
pt_br: A fórmula especificou uma classe, mas a classe não produziu uma função adequada para ser chamada
ru: В формуле указан класс, но класс не создал подходящую функцию для вызова
zh_cn: 公式指定了类，但该类并未生成可以调用的合适函数
zh_tw: 公式指定了類別，但該類別並未產生要呼叫的適當函數

source: The formula references an undefined variable or could not be evaluated:
de: Die Formel verweist auf eine nicht definierte Variable oder konnte nicht ausgewertet werden:
es: No se pudieron evaluar las referencias de fórmulas y las variables no definidas:
fr: La formule fait référence à une variable non définie ou elle n'a pas pu être évaluée :
it: La formula fa riferimento a una variabile non definita oppure non è stato possibile valutarla:
ja: 数式が定義されていない変数を示しているか、評価できません
ko: 수식 참조가 정의되지 않은 변수이거나 계산할 수 없음:
pl: Wzór odnosi się do niezdefiniowanej zmiennej lub nie może zostać obliczony:
pt_br: A fórmula faz referência a uma variável indefinida ou não pôde ser avaliada:
ru: Формула обращается к несуществующей переменной либо не может быть оценена:
zh_cn: 公式引用了未定义的变量或者无法进行求值：
zh_tw: 公式參照未定義的變數或無法評估：

source: Function returned too many values. Number expected: %s
de: Funktion gab zu viele Werte zurück. Erwartete Anzahl: %s
es: La función ha devuelto demasiados valores. Número esperado: %s
fr: La fonction a renvoyé des valeurs trop nombreuses. Nombre attendu : %s
it: La funzione ha restituito troppi valori. Numero previsto: %s
ja: 関数が返した値が多すぎます。 予期される数値 %s
ko: 함수에서 너무 많은 값을 반환했습니다. 필요한 수: %s
pl: Funkcja ta zwracała za dużo wartości. Oczekiwana liczba: %s
pt_br: A função retornou muitos valores. Número esperado: %s
ru: Функция вернула слишком много значений. Ожидаемое число: %s
zh_cn: 函数返回了过多的值。期望的数目：%s
zh_tw: 函數傳回太多的值。預期的數量是：%s

source: The specified function or class was given without a module name and was not found in a previous BEGIN PROGRAM block and is not a built-in function:
de: Die angegebene Funktion oder Klasse wurde ohne Modulnamen bereitgestellt , wurde nicht in einem vorigen Block BEGIN PROGRAM gefunden und ist keine integrierte Funktion:
es: La función o clase especificada se ha proporcionado sin un nombre de módulo y no se ha encontrado en un bloque BEGIN PROGRAM anterior y no es una función incorporada:
fr: La fonction ou la classe indiquée a été fournie sans nom de module et est introuvable dans un bloc BEGIN PROGRAM précédent et n'est pas une fonction intégrée :
it: La funzione o la classe specificata è fornita senza un nome di modulo , non è stata trovata in un precedente blocco BEGIN PROGRAM e non è una funzione incorporata:
ja: 指定された関数またはクラスが、モジュール名なしで指定されました。 以前の BEGIN PROGRAM ブロックにありませんでした。 組み込み関数ではありません:
ko: 지정된 함수 또는 클래스에 모듈 이름이 없고 이전 BEGIN PROGRAM 블록에 없으며 기본 제공 함수가 아닙니다.
pl: Określona funkcja lub klasa została podana bez nazwy modułu i nie została znaleziona w poprzednim bloku BEGIN PROGRAM oraz nie jest to funkcja wbudowana:
pt_br: A função ou classe especificada foi fornecida sem um nome de módulo e não foi localizada em um bloco BEGIN PROGRAM anterior e não é uma função integrada:
ru: Функция (или класс) была задана без указания имени модуля, не была найдена в предыдущем блоке BEGIN PROGRAM и не является встроенной функцией:
zh_cn: 给出了不带模块名的指定函数或类，但在上一个 BEGIN PROGRAM 块中 找不到这个函数或类，它也不是内置函数：
zh_tw: 指定的函數或類別在給定時沒有模組名稱， 在前一個 BEGIN PROGRAM 區塊中找不到， 而且不是內建的函數：

source: The formula syntax given is invalid:
de: Die bereitgestellte Formelsyntax ist ungültig:
es: La sintaxis introducida de la fórmula no es válida:
fr: La syntaxe de la formule fournie n'est pas valide :
it: La sintassi della formula data non è valida:
ja: 指定された数式シンタックスが無効です
ko: 지정한 수식 명령문이 잘못되었음:
pl: Podana składnia wzoru jest nieprawidłowa:
pt_br: A sintaxe da fórmula especificada é inválida:
ru: Заданный синтаксис формулы не является допустимым:
zh_cn: 给出的公式语法无效：
zh_tw: 給定的公式語法無效：

source: Error: the expression is invalid. Check for unbalanced parentheses or quotes or a missing =: %s
de: Fehler: Der Ausdruck ist ungültig. Prüfen Sie auf unpaarige runde Klammern bzw. Anführungszeichen oder ein fehlendes =: %s
es: Error: la expresión no es válida. Compruebe si los paréntesis o las comillas están completos o si falta un =: %s
fr: Erreur : l'expression n'est pas valide. Vérifiez s'il manque des parenthèses, des guillemets ou un signe = : %s
it: Errore: l'espressione non è valida. Verificare la presenza di parentesi o virgolette non bilanciate o di segni di uguale (=) mancanti: %s
ja: エラー: 式が無効です。 不均衡な括弧または引用符または欠損値をチェックします =: %s
ko: 오류: 표현식이 잘못되었습니다. 괄호 또는 따옴표의 짝이 맞지 않는지 또는 =가 없는지 확인합니다: %s
pl: Błąd: niepoprawne wyrażenie. Sprawdź występowanie otwartych nawiasów, cudzysłowu lub braku =: %s
pt_br: Erro: a expressão é inválida. Verifique se há parênteses ou aspas não balanceados ou um = omisso: %s
ru: Ошибка: выражение недопустимо. Проверьте, все ли скобки и кавычки закрыты и не пропущен ли =: %s
zh_cn: 错误：表达式无效。请检查是否存在未配对的括号或引号或者是否缺少 =：%s
zh_tw: 錯誤：表示式無效。請檢查是否存在不對稱的括號或引號，或遺漏 =：%s

source: The number of variable type values differs from the number of result variables
de: Die Anzahl der Variablentypwerte weicht von der Anzahl der Ergebnisvariablen ab.
es: El número de valores de tipos de variable es distinto del número de variables de resultado
fr: Le nombre des valeurs des types de variable diffère du nombre des variables de résultat
it: Il numero di valori dei tipi di variabili è diverso dal numero di variabili
ja: 変数タイプ値の数が結果変数の数と異なります。
ko: 변수 유형 값 수가 결과 변수 수와 다릅니다.
pl: Liczba wartości typów zmiennej różni się od liczby zmiennych wynikowych
pt_br: O número de valores de tipo de variável difere do número de variáveis de
ru: Количество значений типов переменных не совпадает с количеством переменных
zh_cn: 变量类型值的数目与结果变量的数目不同
zh_tw: 變數類型值的數目與結果變數的數目不同

source: Either neither or both names must exist in TO
de: Entweder darf keiner der Namen in TO vorhanden sein oder es müssen beide Namen dort vorhanden sein
es: No existe uno de los nombres, o ambos, en TO
fr: Aucun des noms ou les deux doivent exister dans TO
it: In TO non deve esistere nessuno dei due nomi oppure devono esistere entrambi
ja: TO 内にはどちらの名前も存在しないか、両方の名前が存在する必要があります
ko: 두 이름 모두 TO에 존재하거나 존재하지 않아야 합니다.
pl: Albo żadna albo obie nazwy muszą występować po słowie kluczowym TO
pt_br: Nenhum ou ambos os nomes devem existir em TO
ru: В TO должны существовать либо оба имени, либо ни одно из них
zh_cn: 两个名称必须同时存在或不存在于 TO 中
zh_tw: 兩個名稱必須同時不存在或同時存在於 TO 中

source: Variables in TO are not in file order: %s, %s
de: Variablen in TO haben keine Dateireihenfolge: %s, %s
es: Las variables en TO no están en el orden del archivo: %s, %s
fr: Les variables dans TO ne sont pas dans l'ordre du fichier : %s, %s
it: Le variabili in TO non sono in ordine di file: %s, %s
ja: TO 内の変数はファイル順ではありません: %s、%s
ko: TO의 변수가 파일 순서에 있지 않습니다. %s, %s
pl: Zmienne po słowie TO są w kolejności innej niż porządek w pliku: %s, %s
pt_br: As variáveis em TO não estão na ordem do arquivo: %s, %s
ru: Переменные в TO - не в порядке файлов: %s, %s
zh_cn: TO 中的变量未按文件顺序排列：%s，%s
zh_tw: TO 中的變數不是依檔案順序：%s，%s

source: TO cannot start or end the result list
de: Die Ergebnisliste kann nicht mit TO begonnen oder beendet werden
es: TO no puede iniciar o acabar la lista de resultados
fr: TO ne peut pas commencer ou finir la liste de résultat
it: TO non può iniziare o terminare l'elenco risultati
ja: TO が結果リストを開始または終了できません
ko: TO는 결과 목록을 시작하거나 종료할 수 없습니다.
pl: TO nie może zaczynać się ani kończyć listą wynikową
pt_br: TO não pode iniciar ou terminar a lista de resultados
ru: TO не может начать или закончить список результатов
zh_cn: TO 不能作为结果列表的开头或结尾
zh_tw: TO 無法開始或結束結果清單

source: New variables used with TO must have a numerical suffix
de: Neue mit TO verwendete Variablen müssen ein numerisches Suffix aufweisen
es: Las nuevas variables utilizadas con TO deben tener un sufijo numérico
fr: Les nouvelles variables utilisées avec TO doivent avoir un suffixe numérique
it: Le nuove variabili utilizzate con TO devono avere un suffisso numerico
ja: TO で使用される新規変数は、数値接尾辞を持つ必要があります
ko: TO와 함께 사용된 새 변수에는 연속 접미문자가 있어야 합니다.
pl: Nowe zmienne używane ze słowem TO muszą mieć przyrostek liczbowy
pt_br: Novas variáveis utilizadas com TO devem ter um sufixo numérico
ru: У новых переменных, используемых с TO, должен быть числовой суффикс
zh_cn: 与 TO 配合使用的新变量必须具有数字后缀
zh_tw: 與 TO 搭配使用的新變數必須有數字字尾

source: New variables used with TO must have the same prefix and ascending numerical parts: %s, %s
de: Neue mit TO verwendete Variablen müssen dasselbe Präfix und aufsteigende numerische Abschnitte aufweisen: %s, %s
es: Las nuevas variables utilizadas con TO deben tener el mismo prefijo y partes numéricas ascendentes: %s, %s
fr: Les nouvelles variables utilisées avec TO doivent avoir le même préfixe et les mêmes parties numériques ascendantes : %s, %s
it: Le nuove variabili utilizzate con TO devono avere le stesse parti numeriche crescenti e prefisso: %s, %s
ja: TO で使用される新規変数は、同じ接頭辞および昇順の数値部分を持つ必要があります: %s、%s
ko: TO와 함께 사용된 새 변수에는 동일한 접두문자와 오름차순의 연속 파트가 있어야 합니다. %s, %s
pl: Nowe zmienne używane ze słowem TO muszą mieć ten sam przedrostek i elementy liczbowe w kolejności rosnącej: %s, %s
pt_br: Novas variáveis utilizadas com TO devem ter o mesmo prefixo e partes numéricas crescentes: %s, %s
ru: У новых переменных, используемых с TO, должен быть один и тот же префикс и возрастающие числовые части: %s, %s
zh_cn: 与 TO 配合使用的新变量必须具有相同的前缀，并且数字部分必须按升序排列：%s，%s
zh_tw: 與 TO 搭配使用的新變數必須有相同的字首和遞增數字部分：%s，%s
